cases/ansys_verification/VMFL023/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    cylinder     { type zeroGradient; }
    farField     { type freestreamPressure; freestreamValue uniform 0; }
    frontAndBack { type empty; }
}
// ************************************************************************* //
