cases/ansys_verification/VMFL023/case/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| VMFL023 -- Oscillating Laminar Flow Around a Circular Cylinder.               |
| 2D O-grid, GENERATED FILE.  Emitted by make_blockmeshdict_template.py;        |
| __NT__, __NR__ and __RGRAD__ are substituted by run_vmfl023.sh.               |
| DO NOT HAND-EDIT.                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (1 0 0)                            //  0  r=1 theta=0 z=0
    (6.12323399574e-17 1 0)            //  1  r=1 theta=90 z=0
    (-1 1.22464679915e-16 0)           //  2  r=1 theta=180 z=0
    (-1.83697019872e-16 -1 0)          //  3  r=1 theta=270 z=0
    (60 0 0)                           //  4  r=60 theta=0 z=0
    (3.67394039744e-15 60 0)           //  5  r=60 theta=90 z=0
    (-60 7.34788079488e-15 0)          //  6  r=60 theta=180 z=0
    (-1.10218211923e-14 -60 0)         //  7  r=60 theta=270 z=0
    (1 0 1)                            //  8  r=1 theta=0 z=1
    (6.12323399574e-17 1 1)            //  9  r=1 theta=90 z=1
    (-1 1.22464679915e-16 1)           // 10  r=1 theta=180 z=1
    (-1.83697019872e-16 -1 1)          // 11  r=1 theta=270 z=1
    (60 0 1)                           // 12  r=60 theta=0 z=1
    (3.67394039744e-15 60 1)           // 13  r=60 theta=90 z=1
    (-60 7.34788079488e-15 1)          // 14  r=60 theta=180 z=1
    (-1.10218211923e-14 -60 1)         // 15  r=60 theta=270 z=1
);

blocks
(
    hex (0 4 5 1  8 12 13 9) (__NR__ __NT__ 1) simpleGrading (__RGRAD__ 1 1)  // theta 0 -> 90
    hex (1 5 6 2  9 13 14 10) (__NR__ __NT__ 1) simpleGrading (__RGRAD__ 1 1)  // theta 90 -> 180
    hex (2 6 7 3  10 14 15 11) (__NR__ __NT__ 1) simpleGrading (__RGRAD__ 1 1)  // theta 180 -> 270
    hex (3 7 4 0  11 15 12 8) (__NR__ __NT__ 1) simpleGrading (__RGRAD__ 1 1)  // theta 270 -> 360
);

edges
(
    arc 0  1  (0.707106781187 0.707106781187 0)
    arc 1  2  (-0.707106781187 0.707106781187 0)
    arc 2  3  (-0.707106781187 -0.707106781187 0)
    arc 3  0  (0.707106781187 -0.707106781187 0)
    arc 4  5  (42.4264068712 42.4264068712 0)
    arc 5  6  (-42.4264068712 42.4264068712 0)
    arc 6  7  (-42.4264068712 -42.4264068712 0)
    arc 7  4  (42.4264068712 -42.4264068712 0)
    arc 8  9  (0.707106781187 0.707106781187 1)
    arc 9  10 (-0.707106781187 0.707106781187 1)
    arc 10 11 (-0.707106781187 -0.707106781187 1)
    arc 11 8  (0.707106781187 -0.707106781187 1)
    arc 12 13 (42.4264068712 42.4264068712 1)
    arc 13 14 (-42.4264068712 42.4264068712 1)
    arc 14 15 (-42.4264068712 -42.4264068712 1)
    arc 15 12 (42.4264068712 -42.4264068712 1)
);

boundary
(
    cylinder
    {
        type wall;
        faces
        (
            (0 8 9 1)
            (1 9 10 2)
            (2 10 11 3)
            (3 11 8 0)
        );
    }
    farField
    {
        type patch;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (8 12 13 9)
            (1 2 6 5)
            (9 13 14 10)
            (2 3 7 6)
            (10 14 15 11)
            (3 0 4 7)
            (11 15 12 8)
        );
    }
);

mergePatchPairs ();
// ************************************************************************* //
