cases/ansys_verification/VMFL023/case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// backward = 2nd-order implicit in time; Gauss linear = 2nd-order central in
// space.  Both formally 2nd order, so the formal order p_f = 2 declared on
// pre-registration line 10 is the scheme's, not an aspiration.
ddtSchemes      { default backward; }
gradSchemes     { default Gauss linear; }
divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default corrected; }
// ************************************************************************* //
